folder/constant/MRFProperties
/*--------------------------------*- C++ -*---------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  v1812                                 | 
|   \  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \/     M anipulation  |                                                 | 
\*--------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      MRFProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

MRF
{
    active true;
    selectoinMode cellZone;
    cellZone region0;
    nonRotatingPatches (cyc1 cyc2 inlet outlet outer);
    axis (1.000000 0.000000 0.000000);
    origin (0 0 0);
    omega 532.6;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
